In [1]:
import pandas as pd

Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [9]:
data = [4, 8, 15, 16, 23, 42]

In [10]:
series = pd.Series(data)

In [11]:
type(series)

pandas.core.series.Series

In [12]:
print(series)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [13]:
Name = [1,2,3,4,5,6,7,8,9,10]

In [14]:
series1=pd.Series(Name)

In [15]:
type(series1)

pandas.core.series.Series

In [16]:
print(series1)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

Q3. Create a Pandas DataFrame that contains the following data:

Then, print the DataFrame.

In [17]:
Table = {"Name": ["Alice", "Bob", "Claire"], 
         "Age" : [25,30,27],
         "Gender" : ["Female", "Male", "Female"]}

In [20]:
df = pd.DataFrame(Table)

In [21]:
df.head()

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [22]:
print(df)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

ans:

Data sets in Pandas are usually multi-dimensional tables, called DataFrames.

A Pandas Series is a 1D array of data, but a single-column DataFrame is a 2D table with one column. 

For a single-column DataFrame, an index can be optional, but a Series has to have an index defined.

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

ans: 

some common functions that can be used to manipulate data in a Pandas DataFrame:
    
pd.read_csv

df.describe()

df.info()

df.plot()

df.iloc()

df.loc()

df.assign()

df.query()

df.sort_values()

df.sample()

df.isnull()

df.fillna()

df.dropna()

df.drop()

pd.pivot_table()

df.groupby()

df.transpose()

df.merge()

df.rename()

df.to_csv()

df.describe():

The df.describe() method in pandas is used to generate summary statistics of various features of a DataFrame. It returns a new DataFrame that contains the count, mean, standard deviation, minimum, 25th percentile, median, 75th percentile, and maximum of each numerical column in the original DataFrame.

In [24]:
df.describe()

             Age
count   3.000000
mean   27.333333
std     2.516611
min    25.000000
25%    26.000000
50%    27.000000
75%    28.500000
max    30.000000

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

ans:

Series: one-dimensional array --> Immutable

DataFrame: 2-dimensional array --> Mutable

Panel: 3-dimensional array --> Mutable

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [36]:
courses =pd.Series(["Datascience", "Backend Developer","Frontend Developer"])
fees =pd.Series([22000,25000,23000])
discount  = pd.Series([1000,2300,1000])
dataframe={"Courses": courses, "Fees" : fees, "Discount" :discount}

In [37]:
df = pd.DataFrame(dataframe)

In [38]:
df.head()

              Courses   Fees  Discount
0         Datascience  22000      1000
1   Backend Developer  25000      2300
2  Frontend Developer  23000      1000